## Pandas for Data Analysis

Documentation : https://pandas.pydata.org/pandas-docs/stable/

In [9]:
import numpy as np
import pandas as pd

In [10]:
user_data = {
    "MarksA": np.random.randint(1,100,5),
    "MarksB": np.random.randint(50,100,5),
    "MarksC": np.random.randint(1,100,5)
}

In [11]:
df = pd.DataFrame(user_data)

In [12]:
df

   MarksA  MarksB  MarksC
0       2      79      43
1      86      72      19
2      87      85      87
3      40      67      64
4      15      91      44

In [13]:
df.head(3)

   MarksA  MarksB  MarksC
0       2      79      43
1      86      72      19
2      87      85      87

In [14]:
df.tail(2)

   MarksA  MarksB  MarksC
3      40      67      64
4      15      91      44

In [15]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [18]:
df.to_csv("datasets/marks.csv", index=None)

In [20]:
my_data = pd.read_csv("datasets/marks.csv", index_col=None)

In [21]:
my_data

   MarksA  MarksB  MarksC
0       2      79      43
1      86      72      19
2      87      85      87
3      40      67      64
4      15      91      44

In [22]:
my_data = my_data.drop(columns=["MarksB"])

In [24]:
my_data

   MarksA  MarksC
0       2      43
1      86      19
2      87      87
3      40      64
4      15      44

In [25]:
my_data.describe()

          MarksA    MarksC
count   5.000000   5.00000
mean   46.000000  51.40000
std    39.414464  25.50098
min     2.000000  19.00000
25%    15.000000  43.00000
50%    40.000000  44.00000
75%    86.000000  64.00000
max    87.000000  87.00000

In [37]:
my_data.iloc[4]

MarksA    15
MarksC    44
Name: 4, dtype: int64

In [40]:
my_data.iloc[4][0]

15

In [43]:
my_data.sort_values(by=["MarksA"])

   MarksA  MarksC
0       2      43
4      15      44
3      40      64
1      86      19
2      87      87

In [44]:
my_data.sort_values(by=["MarksA"],ascending=False)

   MarksA  MarksC
2      87      87
1      86      19
3      40      64
4      15      44
0       2      43

In [45]:
my_data.values

array([[ 2, 43],
       [86, 19],
       [87, 87],
       [40, 64],
       [15, 44]])